app/Controllers/Admin/Categories.php

    public function index()
    {
        $model = new CategoryModel();
        return $this->view('admin/categories', [
            'title'      => 'Kategori - CariIn Admin',
            'categories' => $model->orderBy('sort_order', 'ASC')->findAll(),
---
SELECT *
FROM `categories`
ORDER BY `sort_order` ASC