app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $userModel     = new UserModel();
        $propertyModel = new PropertyModel();
        $paymentModel  = new PaymentModel();

        $data = [
            'title' => 'Admin Dashboard - CariIn',
            'stats' => [
                'total_users'       => $userModel->countAllResults(),
                'total_members'     => $userModel->where('role', 'member')->countAllResults(),
                'total_properties'  => $propertyModel->countAllResults(),
                'pending_review'    => $propertyModel->where('status', 'pending_review')->countAllResults(),
                'published'         => $propertyModel->where('status', 'published')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'member'
SELECT COUNT(*) AS `numrows`
FROM `properties`
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'pending_review'
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'published'