app/Controllers/Admin/Finance.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Totals
        $totalTopup = (int) ($db->table('topups')->selectSum('amount_rp')->where('status', 'success')->get()->getRow('amount_rp') ?? 0);
        $totalPayments = (int) ($db->table('payments')->selectSum('amount')->where('status', 'success')->get()->getRow('amount') ?? 0);
        $pendingTopup = (int) ($db->table('topups')->where('status', 'pending')->countAllResults());
        $totalUsers = (new UserModel())->countAllResults();

        // Monthly revenue (last 6 months)
        $monthly = [];
        for ($i = 5; $i >= 0; $i--) {
            $start = date('Y-m-01 00:00:00', strtotime("-{$i} month"));
            $end   = date('Y-m-t 23:59:59', strtotime("-{$i} month"));
            $sumTopup = (int) ($db->table('topups')->selectSum('amount_rp')
                ->where('status', 'success')->where('paid_at >=', $start)->where('paid_at <=', $end)
                ->get()->getRow('amount_rp') ?? 0);
            $sumPay = (int) ($db->table('payments')->selectSum('amount')
                ->where('status', 'success')->where('paid_at >=', $start)->where('paid_at <=', $end)
                ->get()->getRow('amount') ?? 0);
            $monthly[] = [
                'label' => date('M Y', strtotime($start)),
                'value' => $sumTopup + $sumPay,
            ];
        }

        // Latest transactions (combined topups+payments)
        $topups   = (new TopupModel())->orderBy('created_at', 'DESC')->findAll(10);
        $payments = (new PaymentModel())->orderBy('created_at', 'DESC')->findAll(10);
---
SELECT SUM(`amount_rp`) AS `amount_rp`
FROM `topups`
WHERE `status` = 'success'
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `status` = 'success'
SELECT COUNT(*) AS `numrows`
FROM `topups`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT SUM(`amount_rp`) AS `amount_rp`
FROM `topups`
WHERE `status` = 'success'
AND `paid_at` >= '2025-11-01 00:00:00'
AND `paid_at` <= '2025-11-30 23:59:59'
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `status` = 'success'
AND `paid_at` >= '2025-11-01 00:00:00'
AND `paid_at` <= '2025-11-30 23:59:59'
SELECT *
FROM `topups`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT *
FROM `payments`
ORDER BY `created_at` DESC
 LIMIT 10

    public function topupHistory()
    {
        $db = \Config\Database::connect();
        $rows = $db->table('topups t')
            ->select('t.*, u.name AS user_name, u.email AS user_email')
            ->join('users u', 'u.id = t.user_id', 'left')
            ->orderBy('t.created_at', 'DESC')
            ->limit(200)
            ->get()->getResultArray();
---
SELECT `t`.*, `u`.`name` AS `user_name`, `u`.`email` AS `user_email`
FROM `topups` `t`
LEFT JOIN `users` `u` ON `u`.`id` = `t`.`user_id`
ORDER BY `t`.`created_at` DESC
 LIMIT 200