app/Controllers/Admin/Moderation.php

    public function index()
    {
        $db = \Config\Database::connect();
        $status = $this->request->getGet('status') ?? 'pending_review';
        if (! in_array($status, ['pending_review', 'published', 'rejected', 'sold'], true)) {
            $status = 'pending_review';
        }

        $rows = $db->table('properties p')
            ->select('p.id, p.title, p.slug, p.type, p.price, p.status, p.city, p.created_at,
                      c.name AS category_name, u.name AS seller_name, u.email AS seller_email,
                      (SELECT file_name FROM property_images WHERE property_id = p.id ORDER BY is_cover DESC LIMIT 1) AS cover_image')
            ->join('categories c', 'c.id = p.category_id', 'left')
            ->join('users u', 'u.id = p.user_id', 'left')
            ->where('p.status', $status)
            ->orderBy('p.created_at', 'DESC')
            ->get(50)
            ->getResultArray();

        // Stats
        $stats = [
            'total'    => $db->table('properties')->countAllResults(),
            'pending'  => $db->table('properties')->where('status', 'pending_review')->countAllResults(),
            'approved' => $db->table('properties')->where('status', 'published')->countAllResults(),
            'rejected' => $db->table('properties')->where('status', 'rejected')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'pending_review'
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'rejected'