app/Controllers/Admin/Transactions.php

SELECT *
FROM `payments`
ORDER BY `created_at` DESC
 LIMIT 100
---
    public function index()
    {
        $model = new PaymentModel();
        $rows  = $model->orderBy('created_at', 'DESC')->findAll(100);