app/Controllers/Admin/Users.php

SELECT *
FROM `users`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $userModel = new UserModel();
        $users     = $userModel->orderBy('created_at', 'DESC')->findAll();