app/Controllers/Home.php

    public function index()
    {
        $propertyModel = new PropertyModel();
        $categoryModel = new CategoryModel();
        $db = \Config\Database::connect();

        // Stats for hero
        $totalProperties = $propertyModel->where('status', 'published')->countAllResults();
        $totalAgents     = $db->table('users')->where('role', 'member')->countAllResults();
        $totalSuccess    = $propertyModel->where('status', 'sold')->countAllResults();
        $citiesRow       = $db->table('properties')->select('COUNT(DISTINCT city) AS n')->where('status', 'published')->get()->getRowArray();

        // Categories with count
        $cats = $categoryModel->getActive();
        foreach ($cats as &$c) {
            $c['count'] = $db->table('properties')->where('category_id', $c['id'])->where('status', 'published')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'member'
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `status` = 'sold'
SELECT COUNT(DISTINCT city) AS n
FROM `properties`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `properties`
WHERE `category_id` = '1'
AND `status` = 'published'