app/Models/CategoryModel.php

    public function getActive(): array
    {
        return $this->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC