app/Models/PaymentModel.php

    public function totalRevenue(): int
    {
        $row = $this->selectSum('amount', 'total')->where('status', 'success')->first();
---
SELECT SUM(`amount`) AS `total`
FROM `payments`
WHERE `status` = 'success'
 LIMIT 1