app/Models/PropertyModel.php

SELECT `p`.*, `c`.`name` AS `category_name`, `c`.`slug` AS `category_slug`, `c`.`form_type`, `u`.`name` AS `seller_name`, `u`.`avatar_url` AS `seller_avatar`, `u`.`phone` AS `seller_phone`, `u`.`email` AS `seller_email`
FROM `properties` `p`
LEFT JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
LEFT JOIN `users` `u` ON `u`.`id` = `p`.`user_id`
WHERE `p`.`slug` = 'tanah-sayap-tki-jl-purwa-indah-2-3-11'
---
    public function findBySlugFull(string $slug): ?array
    {
        $row = $this->db->table($this->table . ' p')
            ->select('p.*, c.name AS category_name, c.slug AS category_slug, c.form_type,
                      u.name AS seller_name, u.avatar_url AS seller_avatar, u.phone AS seller_phone, u.email AS seller_email')
            ->join('categories c', 'c.id = p.category_id', 'left')
            ->join('users u', 'u.id = p.user_id', 'left')
            ->where('p.slug', $slug)
            ->get()
            ->getRowArray();

UPDATE `properties` SET `views` = `views` + 1
WHERE `id` = 2
---
    public function incrementViews(int $propertyId): void
    {
        $this->db->table($this->table)->where('id', $propertyId)->increment('views');