app/Models/PropertyDetailModel.php

SELECT *
FROM `property_details`
WHERE `property_id` = 2
---
    public function getByProperty(int $propertyId): array
    {
        $rows = $this->where('property_id', $propertyId)->findAll();