app/Models/PropertyImageModel.php

SELECT *
FROM `property_images`
WHERE `property_id` = 2
ORDER BY `is_cover` DESC, `sort_order` ASC
---
    public function getByProperty(int $propertyId): array
    {
        return $this->where('property_id', $propertyId)
            ->orderBy('is_cover', 'DESC')
            ->orderBy('sort_order', 'ASC')
            ->findAll();