app/Models/SellerRatingModel.php

    public function summaryForSeller(int $sellerId): array
    {
        $db = \Config\Database::connect();
        $row = $db->table('seller_ratings')
            ->select('AVG(rating) AS avg_rating, COUNT(*) AS total')
            ->where('seller_id', $sellerId)
            ->get()->getRowArray();
---
SELECT AVG(rating) AS avg_rating, COUNT(*) AS total
FROM `seller_ratings`
WHERE `seller_id` = 2

    public function listForSeller(int $sellerId, int $limit = 10): array
    {
        $db = \Config\Database::connect();
        return $db->table('seller_ratings r')
            ->select('r.*, u.name AS reviewer_name, u.avatar_url AS reviewer_avatar')
            ->join('users u', 'u.id = r.reviewer_id', 'left')
            ->where('r.seller_id', $sellerId)
            ->orderBy('r.created_at', 'DESC')
            ->limit($limit)
            ->get()->getResultArray();
---
SELECT `r`.*, `u`.`name` AS `reviewer_name`, `u`.`avatar_url` AS `reviewer_avatar`
FROM `seller_ratings` `r`
LEFT JOIN `users` `u` ON `u`.`id` = `r`.`reviewer_id`
WHERE `r`.`seller_id` = 2
ORDER BY `r`.`created_at` DESC
 LIMIT 5