app/Models/SettingModel.php

SELECT *
FROM `settings`
WHERE `key` = 'footer_description'
 LIMIT 1
UPDATE `settings` SET `value` = 'Marketplace properti Indonesia yang menghubungkan penjual & pembeli dengan lebih cepat, aman, dan terpercaya.', `updated_at` = '2026-04-25 20:12:08'
WHERE `settings`.`id` IN ('1')
---
    public function setValue(string $key, string $value): void
    {
        $existing = $this->where('key', $key)->first();
        if ($existing) {
            $this->update($existing['id'], ['value' => $value]);

SELECT *
FROM `settings`
---
    public function getAll(): array
    {
        $rows = $this->findAll();