app/Models/WishlistModel.php

    public function isWished(int $userId, int $propertyId): bool
    {
        return (bool) $this->where(['user_id' => $userId, 'property_id' => $propertyId])->first();
---
SELECT *
FROM `wishlists`
WHERE `user_id` = 1
AND `property_id` = 2
 LIMIT 1